#+title: My Literate emacs config
This is my config file for [[https://www.gnu.org/software/emacs/][emacs]]!

** org-num settings
#+begin_src emacs-lisp
  (customize-set-variable 'org-num-skip-unnumbered t)
  (customize-set-variable 'org-num-skip-commented t)
  (customize-set-variable 'org-num-skip-tags '("ignore" "nolatex" "noexport"))
#+end_src

#+RESULTS:
| ignore | nolatex | noexport |

** COMMENT eval-in-repl
from: https://iqss.github.io/IQSS.emacs/init.html#general_repl_(comint)_config
use other programming languages in interactive environment, similar to how ESS does it
#+begin_src emacs-lisp
  (use-package eval-in-repl
    :hook (comint-mode . (lambda() (setq truncate-lines 1)))
    :custom
    (comint-process-echoes t
      eir-repl-placement 'below)
    (comint-scroll-to-bottom-on-input t)
    (comint-scroll-to-bottom-on-output t)
    (comint-move-point-for-output t))
#+end_src

#+RESULTS:
| lambda | nil | (setq truncate-lines 1) |

*** electric-spacing operator
Put spaces around operators such as +, -, etc.
#+begin_src emacs-lisp
  (use-package electric-operator
    :hook ((R-mode ess-r-mode inferior-ess-r-mode) . electric-operator-mode)
    :config
    (electric-operator-add-rules-for-mode 'stan-mode
                                          (cons "," ", ")
                                          (cons "~" " ~ "))

    (electric-operator-add-rules-for-mode 'ess-r-mode
                                          (cons ".+" " . + ")
                                          ;; these should never have spacing around them
                                          (cons ":" ":") ;; for ranges, should not add space
                                          (cons "::" "::") ;; to call a function from a package
                                          (cons ":::" ":::") ;; to call an internal function from a package
                                          (cons ":=" " := ") ;; walrus operator
                                          (cons "? " "?")
                                          (cons "){" ") {")
                                          (cons "}else{" "} else {")
                                          (cons "for(" "for (")
                                          (cons "if(" "if (")
                                          (cons "while(" "while (")
                                          (cons "{{" " {{ ") ;; curly-curly tidyverse
                                          (cons "}}" " }} ")
                                          (cons "!!" " !!")
                                          (cons "!!!" " !!!")
                                          (cons "^" "^") ;;
                                          (cons "|>" " |> ") ;; r 4.0 built-in pipe
                                          )
    :custom
    (electric-operator-R-named-argument-style 'spaced))
#+end_src

#+RESULTS:
| electric-operator-mode | electric-layout-mode |

*** compilation window height
#+begin_src emacs-lisp
  (setq compilation-window-height 15)
#+end_src

#+RESULTS:
: 15

** COMMENT matlab
if I'm ever required to work in non-open-source
#+begin_src emacs-lisp
  (use-package matlab
    :ensure nil
    :init (autoload 'matlab-mode "matlab" "Matlab Editing Mode" t)
    :mode ("\\.m\\'" . matlab-mode)
    :interpreter "matlab"
    :custom
    (matlab-indent-function t)
    (matlab-indent-function "matlab"))
#+end_src

#+RESULTS:
: ((matlab . matlab) (r . ess-r-mode) (Rscript . ess-r-mode) (ruby1.8 . ruby-mode) (ruby1.9 . ruby-mode) (jruby . ruby-mode) (rbx . ruby-mode) (ruby . ruby-mode) (python[0-9.]* . python-mode) (rhino . js-mode) (gjs . js-mode) (nodejs . js-mode) (node . js-mode) (gawk . awk-mode) (nawk . awk-mode) (mawk . awk-mode) (awk . awk-mode) (pike . pike-mode) (\(mini\)?perl5? . perl-mode) (wishx? . tcl-mode) (tcl\(sh\)? . tcl-mode) (expect . tcl-mode) (octave . octave-mode) (scm . scheme-mode) ([acjkwz]sh . sh-mode) (r?bash2? . sh-mode) (dash . sh-mode) (mksh . sh-mode) (\(dt\|pd\|w\)ksh . sh-mode) (es . sh-mode) (i?tcsh . sh-mode) (oash . sh-mode) (rc . sh-mode) (rpm . sh-mode) (sh5? . sh-mode) (tail . text-mode) (more . text-mode) (less . text-mode) (pg . text-mode) (make . makefile-gmake-mode) (guile . scheme-mode) (clisp . lisp-mode) (emacs . emacs-lisp-mode))

** pandoc-mode
exporting markdown
#+begin_src emacs-lisp
  (use-package pandoc-mode
    :defer t
    :hook markdown-mode)
#+end_src

#+RESULTS:
| pandoc-mode |

** COMMENT helm-bibtex
#+begin_src emacs-lisp
  (setq
   bibtex-completion-notes-path "/home/japhir/SurfDrive/bibliography/notes/"
   ;; bibtex-completion-bibliography "/home/japhir/SurfDrive/bibliography/references.bib" ; defined elsewhere
   ;; bibtex-completion-pdf-field "file"
   bibtex-completion-notes-template-multiple-files
   (concat
   "#+title: ${title}\n"
   "#+created: %u\n"
   "#+last_modified: %U\n"
   "#+roam_key: cite:${=key=}\n\n\n"
   "* TODO Notes\n"
   ":PROPERTIES:\n"
   ":Custom_ID: ${=key=}\n"
   ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
   ":AUTHOR: ${author-abbrev}\n"
   ":JOURNAL: ${journaltitle}\n"
   ":DATE: ${date}\n"
   ":YEAR: ${year}\n"
   ":DOI: ${doi}\n"
   ":URL: ${url}\n"
   ":END:\n\n"))
#+end_src

#+RESULTS:
#+begin_example
,#+title: ${title}
,#+created: %u
,#+last_modified: %U
,#+roam_key: cite:${=key=}


,* TODO Notes
:PROPERTIES:
:Custom_ID: ${=key=}
:NOTER_DOCUMENT: %(orb-process-file-field "${=key=}")
:AUTHOR: ${author-abbrev}
:JOURNAL: ${journaltitle}
:DATE: ${date}
:YEAR: ${year}
:DOI: ${doi}
:URL: ${url}
:END:

#+end_example

